IdeaRS.OpenModel.SteelSetupAISC
Steel setup IBC class

IdeaRS.OpenModel.SteelSetupAISC.ReductionFactorTension
ACI 318

IdeaRS.OpenModel.SteelSetupAISC.ReductionFactorShear
ACI 318

IdeaRS.OpenModel.SteelSetupAISC.BoltTensileShear_Omega
Safety factor BoltTensileShear_Omega

IdeaRS.OpenModel.SteelSetupAISC.BoltTensileShearCombined_Omega
Safety factor BoltTensileShearCombined_Omega

IdeaRS.OpenModel.SteelSetupAISC.BoltBearing_Omega
Safety factor BoltBearing_Omega

IdeaRS.OpenModel.SteelSetupAISC.FilletWelds_Omega
Safety factor FilletWelds_Omega

IdeaRS.OpenModel.SteelSetupAISC.BoltTensileShear_Phi
Safety factor BoltTensileShear_Phi

IdeaRS.OpenModel.SteelSetupAISC.BoltTensileShearCombined_Phi
Safety factor BoltTensileShearCombined_Phi

IdeaRS.OpenModel.SteelSetupAISC.BoltBearing_Phi
Safety factor BoltBearing_Phi

IdeaRS.OpenModel.SteelSetupAISC.FilletWelds_Phi
Safety factor FilletWelds_Phi

IdeaRS.OpenModel.SteelSetupAISC.MaterialFy_Omega
Safety factor MaterialFy_Omega

IdeaRS.OpenModel.SteelSetupAISC.MaterialFy_Phi
Safety factor MaterialFy_Phi

IdeaRS.OpenModel.SteelSetupAISC.BoltSlipRes_Phi
Safety factor BoltSlipRes_Phi

IdeaRS.OpenModel.SteelSetupAISC.BoltSlipRes_Omega
Safety factor BoltSlipRes_Phi